[
  {
    "name": "Kaminoko Pond",
    "nameJapanese": "神の子池",
    "city": "Kiyosato",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A tiny, supernaturally clear blue pond fed by underground springs from Lake Mashu. The water stays at a constant 8 degrees Celsius year-round, meaning submerged fallen trees never decompose. The pond's color shifts from cobalt blue in summer to deep indigo in winter.",
    "shortDescription": "Crystal-clear blue pond fed by underground springs, with water so pure submerged trees never decompose.",
    "lat": 43.58,
    "lng": 144.85
  },
  {
    "name": "Rebun Island",
    "nameJapanese": "礼文島",
    "city": "Rebun",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "Known as the 'Island of Flowers,' this remote island hosts rare alpine flora blooming against rugged sea cliffs. The 8-hour Rebun Island Trail in early summer offers extraordinary wildflower hiking found nowhere else in Japan.",
    "shortDescription": "Remote northern island with rare alpine wildflowers blooming at sea level against dramatic sea cliffs.",
    "lat": 45.3,
    "lng": 141.05
  },
  {
    "name": "Cape Kamui",
    "nameJapanese": "神威岬",
    "city": "Shakotan",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "viewpoint",
    "description": "A dramatic cape jutting into the Sea of Japan on the Shakotan Peninsula, accessible via a narrow cliffside walking path. The surrounding waters are known as 'Shakotan Blue' for their extraordinary turquoise clarity.",
    "shortDescription": "Dramatic cape with a cliffside walking path above extraordinary turquoise 'Shakotan Blue' waters.",
    "lat": 43.33,
    "lng": 140.35
  },
  {
    "name": "Seseki Onsen",
    "nameJapanese": "セセキ温泉",
    "city": "Rausu",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "onsen",
    "description": "A wild, tide-dependent hot spring on the Shiretoko Peninsula coast where 64-degree water flows directly from rocks into the sea. The spring is only accessible at certain tide levels, making it an elemental bathing experience.",
    "shortDescription": "Wild tide-dependent hot spring on the Shiretoko coast where volcanic water meets the sea.",
    "lat": 44.1,
    "lng": 145.3
  },
  {
    "name": "Lake Toyoni",
    "nameJapanese": "豊似湖",
    "city": "Erimo",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A heart-shaped lake visible from above, nestled in dense forest in the Hidaka region. Surrounded by virgin forest and accessible only by forest road, it is one of Hokkaido's most secluded natural features.",
    "shortDescription": "Heart-shaped lake nestled in virgin forest, visible only from above in remote Hidaka region.",
    "lat": 42.05,
    "lng": 143.2
  },
  {
    "name": "Ginkonyu Hot Spring",
    "nameJapanese": "銀婚湯",
    "city": "Yakumo",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "onsen",
    "description": "A historic hot spring originating from the sandbanks of the Otoshibe River, said to have been used by the indigenous Ainu people. The baths use absolutely no circulation, filtration, or chlorine — pure, untreated thermal water.",
    "shortDescription": "Historic Ainu-origin hot spring using completely unprocessed, untreated thermal water.",
    "lat": 42.18,
    "lng": 140.25
  },
  {
    "name": "Shirogane Blue Pond",
    "nameJapanese": "白金青い池",
    "city": "Biei",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A surreal pond where aluminum-rich volcanic runoff gives the water an otherworldly cobalt blue color. Dead larch trees stand in the water like ghostly sentinels. It gained fame after Apple used it as a default macOS wallpaper.",
    "shortDescription": "Surreal cobalt-blue pond with ghostly dead trees, created by volcanic mineral runoff near Biei.",
    "lat": 43.39,
    "lng": 142.6
  },
  {
    "name": "Akkeshi",
    "nameJapanese": "厚岸",
    "city": "Akkeshi",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A serene coastal town known for Japan's finest oysters, harvested from nutrient-rich Akkeshi Bay. The town features the Akkeshi Bekanbeushi Wetland, a Ramsar site with abundant birdlife including red-crowned cranes.",
    "shortDescription": "Coastal town with world-class oysters and a Ramsar-designated wetland rich with birdlife.",
    "lat": 43.05,
    "lng": 144.84
  },
  {
    "name": "Numa-no-Hara High Moor",
    "nameJapanese": "沼ノ原湿原",
    "city": "Kamikawa",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A designated National Natural Monument at 1,440 meters in the central Daisetsuzan range. This high-altitude moorland features pristine alpine meadows and panoramic mountain views far from popular ropeway access points.",
    "shortDescription": "Pristine alpine moorland at 1,440m in Daisetsuzan, reachable only by multi-hour hike.",
    "lat": 43.5,
    "lng": 142.95
  },
  {
    "name": "Ayamegahara Nature Reserve",
    "nameJapanese": "あやめヶ原自然公園",
    "city": "Kushiro",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A sprawling 100-hectare natural sanctuary on coastal cliffs with over 100 species of wildflowers blooming from May through October. Wild horses graze freely in the reserve against Pacific Ocean panoramas.",
    "shortDescription": "Coastal cliff sanctuary with 100+ wildflower species and free-roaming wild horses.",
    "lat": 43.1,
    "lng": 145.0
  },
  {
    "name": "Funbe Falls",
    "nameJapanese": "フンベの滝",
    "city": "Erimo",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A unique coastal waterfall where spring water cascades down seaside cliffs. In winter, the falling water freezes into magnificent ice columns, creating dramatic natural sculptures against the ocean backdrop.",
    "shortDescription": "Coastal waterfall that freezes into spectacular ice columns in winter along the Erimo coast.",
    "lat": 42.0,
    "lng": 143.15
  },
  {
    "name": "Lake Notoro",
    "nameJapanese": "能取湖",
    "city": "Abashiri",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A brackish lagoon where, every September, vast colonies of glasswort turn the entire shoreline a vivid crimson red. The effect transforms the lake's edge into what appears to be a carpet of red coral stretching to the horizon.",
    "shortDescription": "Lagoon where glasswort colonies turn the shoreline vivid crimson each September.",
    "lat": 44.08,
    "lng": 144.18
  },
  {
    "name": "Saru River Primeval Forest",
    "nameJapanese": "沙流川源流原始林",
    "city": "Hidaka",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "nature",
    "description": "A national natural monument featuring virgin coniferous forest along the headwaters of the Saru River in the Hidaka Mountains. The deep gorge scenery with ancient trees and untouched wilderness is among Japan's most pristine.",
    "shortDescription": "Virgin coniferous forest along the Saru River headwaters in Hokkaido's last true wilderness.",
    "lat": 42.9,
    "lng": 142.55
  },
  {
    "name": "Wakkanai",
    "nameJapanese": "稚内",
    "city": "Wakkanai",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "landmark",
    "description": "Japan's northernmost city, featuring Cape Soya (Japan's northernmost point), the Soviet-era North Breakwater Dome, and the vast Sarobetsu Wetland with rare wildflowers. Summer temperatures average just 20 degrees Celsius.",
    "shortDescription": "Japan's northernmost city with Cape Soya, Soviet-era architecture, and vast peatland wetlands.",
    "lat": 45.42,
    "lng": 141.68
  },
  {
    "name": "Nakadake Onsen",
    "nameJapanese": "中岳温泉",
    "city": "Kamikawa",
    "prefecture": "Hokkaido",
    "region": "Hokkaido",
    "category": "onsen",
    "description": "A wild hot spring deep in the Daisetsuzan mountains where visitors dig their own bath in geothermally heated ground. No facilities, buildings, or fees — just hot water seeping from the earth in a high alpine setting.",
    "shortDescription": "Dig-your-own wild hot spring deep in Daisetsuzan with no facilities — pure alpine bathing.",
    "lat": 43.55,
    "lng": 142.9
  },
  {
    "name": "Ouchi-juku",
    "nameJapanese": "大内宿",
    "city": "Shimogo",
    "prefecture": "Fukushima",
    "region": "Tohoku",
    "category": "landmark",
    "description": "A remarkably preserved Edo-period post town with thatched-roof houses lining both sides of the main road. Famous for negi-soba — buckwheat noodles eaten using a whole spring onion as a utensil. The winter snow festival transforms the village into a lantern-lit scene.",
    "shortDescription": "Preserved Edo-period thatched-roof post town famous for noodles eaten with a spring onion.",
    "lat": 37.33,
    "lng": 139.85
  },
  {
    "name": "Dewa Sanzan",
    "nameJapanese": "出羽三山",
    "city": "Tsuruoka",
    "prefecture": "Yamagata",
    "region": "Tohoku",
    "category": "shrine",
    "description": "A sacred trio of mountains that have been a center of Shugendo mountain asceticism since the 6th century. Mt. Haguro's 2,446-step stone staircase through ancient cedar forest is one of Japan's most atmospheric spiritual walks.",
    "shortDescription": "Sacred three mountains of Shugendo asceticism with a 2,446-step cedar-lined stone staircase.",
    "lat": 38.7,
    "lng": 139.98
  },
  {
    "name": "Nyuto Onsen Village",
    "nameJapanese": "乳頭温泉郷",
    "city": "Senboku",
    "prefecture": "Akita",
    "region": "Tohoku",
    "category": "onsen",
    "description": "A cluster of seven traditional hot spring inns in mountain forest, with Tsurunoyu dating to 1638. Features four distinct thermal springs, thatched-roof buildings, irori hearth dining, and oil lamp-lit rooms with no television.",
    "shortDescription": "Mountain forest village of seven traditional hot spring inns, the oldest dating to 1638.",
    "lat": 39.78,
    "lng": 140.78
  },
  {
    "name": "Geibikei Gorge",
    "nameJapanese": "猊鼻渓",
    "city": "Ichinoseki",
    "prefecture": "Iwate",
    "region": "Tohoku",
    "category": "nature",
    "description": "A National Place of Scenic Beauty where visitors glide through a narrow river gorge on traditional flat-bottomed boats for 90 minutes. The boatman poles silently through the water and sings traditional folk songs echoing off cliff faces.",
    "shortDescription": "Narrow river gorge navigated by traditional boats with a singing boatman among towering cliffs.",
    "lat": 38.93,
    "lng": 141.18
  },
  {
    "name": "Goshikinuma",
    "nameJapanese": "五色沼",
    "city": "Kitashiobara",
    "prefecture": "Fukushima",
    "region": "Tohoku",
    "category": "nature",
    "description": "A series of volcanic ponds formed after the 1888 eruption of Mount Bandai. Minerals and algae create waters that shift between emerald green, cobalt blue, turquoise, and rust red depending on sunlight. A 3.6-kilometer trail connects them.",
    "shortDescription": "Volcanic ponds shifting between emerald, cobalt, turquoise, and rust red along a forest trail.",
    "lat": 37.7,
    "lng": 140.08
  },
  {
    "name": "Ginzan Onsen",
    "nameJapanese": "銀山温泉",
    "city": "Obanazawa",
    "prefecture": "Yamagata",
    "region": "Tohoku",
    "category": "onsen",
    "description": "A tiny hot spring town of wooden ryokan lining both banks of the Ginzan River, lit by gas lamps at night. Said to have inspired Miyazaki's 'Spirited Away.' The wooden facades and warm lamplight create one of Japan's most atmospheric townscapes under winter snow.",
    "shortDescription": "Gas-lamp-lit wooden ryokan along a river, said to have inspired Spirited Away's bathhouse town.",
    "lat": 38.57,
    "lng": 140.3
  },
  {
    "name": "Yamadera",
    "nameJapanese": "山寺",
    "city": "Yamagata",
    "prefecture": "Yamagata",
    "region": "Tohoku",
    "category": "temple",
    "description": "A spectacular mountainside temple complex founded in 860 CE, where 1,000 stone steps climb through ancient cedar forest to cliff-edge halls. Haiku master Basho composed his famous cicada verse here in 1689.",
    "shortDescription": "Mountainside temple of 1,000 stone steps through cedar forest, immortalized by haiku master Basho.",
    "lat": 38.31,
    "lng": 140.44
  },
  {
    "name": "Aoike Pond",
    "nameJapanese": "青池",
    "city": "Fukaura",
    "prefecture": "Aomori",
    "region": "Tohoku",
    "category": "nature",
    "description": "A mystical deep-blue pond within the Juniko area of the Shirakami Sanchi UNESCO World Heritage Site. The water has 9-meter visibility with submerged beech trees visible against cobalt depths. The blue color has no confirmed scientific explanation.",
    "shortDescription": "Mystical cobalt-blue pond in a UNESCO World Heritage beech forest with unexplained coloring.",
    "lat": 40.53,
    "lng": 139.93
  },
  {
    "name": "Tonohetsuri Cliffs",
    "nameJapanese": "塔のへつり",
    "city": "Shimogo",
    "prefecture": "Fukushima",
    "region": "Tohoku",
    "category": "nature",
    "description": "Bizarre tower-shaped rock formations carved by the Osokawa River over millions of years. A suspension bridge crosses to a Buddhist shrine in a natural cave within the cliff face. The layered rock strata create dramatic mushroom-shaped formations.",
    "shortDescription": "Tower-shaped rock formations with a suspension bridge to a cave shrine in the cliff face.",
    "lat": 37.35,
    "lng": 139.88
  },
  {
    "name": "Kitayamazaki Cliffs",
    "nameJapanese": "北山崎",
    "city": "Tanohata",
    "prefecture": "Iwate",
    "region": "Tohoku",
    "category": "viewpoint",
    "description": "Sheer 200-meter coastal cliffs along the Sanriku Coast with sea caves, arches, and isolated rock pillars. Considered to have the most powerful coastal scenery in all of Japan. The Michinoku Coastal Trail passes along the clifftop.",
    "shortDescription": "Sheer 200-meter Pacific cliffs with sea caves and arches — Japan's most dramatic coastal scenery.",
    "lat": 39.9,
    "lng": 141.95
  },
  {
    "name": "Zao Fox Village",
    "nameJapanese": "宮城蔵王キツネ村",
    "city": "Shiroishi",
    "prefecture": "Miyagi",
    "region": "Tohoku",
    "category": "entertainment",
    "description": "A unique wildlife park where approximately 100 foxes of six different breeds roam freely in forested enclosures. Visitors walk among the foxes and can feed them from elevated platforms in a semi-wild mountain setting.",
    "shortDescription": "Mountain wildlife park where six breeds of foxes roam freely in forested enclosures.",
    "lat": 37.9,
    "lng": 140.52
  },
  {
    "name": "Okama Crater Lake",
    "nameJapanese": "蔵王の御釜",
    "city": "Zao",
    "prefecture": "Miyagi",
    "region": "Tohoku",
    "category": "nature",
    "description": "A circular volcanic crater lake at the summit of Mount Zao that changes color between emerald green, turquoise blue, and gray depending on weather and mineral content. Accessible only from late April through early November.",
    "shortDescription": "Color-changing volcanic crater lake at Mount Zao's summit, shifting between emerald and turquoise.",
    "lat": 38.14,
    "lng": 140.44
  },
  {
    "name": "Kosode Coast",
    "nameJapanese": "小袖海岸",
    "city": "Kuji",
    "prefecture": "Iwate",
    "region": "Tohoku",
    "category": "landmark",
    "description": "The northernmost point in Japan where the ancient tradition of ama diving (female free-divers harvesting shellfish) continues. Visitors can watch the ama divers work along the dramatic rocky coastline.",
    "shortDescription": "Northernmost ama diving site where female free-divers harvest shellfish along rocky cliffs.",
    "lat": 40.18,
    "lng": 141.82
  },
  {
    "name": "Naruko Gorge",
    "nameJapanese": "鳴子峡",
    "city": "Osaki",
    "prefecture": "Miyagi",
    "region": "Tohoku",
    "category": "nature",
    "description": "A 2.6-kilometer canyon with precipitous cliff faces that turn brilliant red, orange, and gold during autumn. Adjacent to Naruko Onsen, one of Tohoku's oldest hot spring towns known for its kokeshi doll craft tradition.",
    "shortDescription": "Spectacular autumn canyon beside an ancient hot spring town known for kokeshi doll crafting.",
    "lat": 38.75,
    "lng": 140.68
  },
  {
    "name": "Mount Chokai",
    "nameJapanese": "鳥海山",
    "city": "Yuza",
    "prefecture": "Yamagata",
    "region": "Tohoku",
    "category": "mountain",
    "description": "The highest peak in Tohoku at 2,236 meters, called 'Dewa Fuji' for its symmetrical volcanic cone. At its base, the Mototaki spring produces crystal-clear water emerging from mossy stones in dozens of delicate streams.",
    "shortDescription": "Tohoku's highest peak with a symmetrical cone and crystal-clear spring waters at its base.",
    "lat": 39.1,
    "lng": 140.05
  },
  {
    "name": "Enzo-ji Temple",
    "nameJapanese": "圓蔵寺",
    "city": "Yanaizu",
    "prefecture": "Fukushima",
    "region": "Tohoku",
    "category": "temple",
    "description": "A spectacular Buddhist temple perched on a cliff above the Tadami River in rural western Fukushima. The town of Yanaizu is the birthplace of the akabeko (red cow) folk art tradition. The winter scene of wooden halls against snow-covered cliffs is iconic.",
    "shortDescription": "Cliff-perched temple above the Tadami River in the birthplace of akabeko folk art.",
    "lat": 37.53,
    "lng": 139.72
  },
  {
    "name": "Tanesashi Coast",
    "nameJapanese": "種差海岸",
    "city": "Hachinohe",
    "prefecture": "Aomori",
    "region": "Tohoku",
    "category": "nature",
    "description": "A uniquely beautiful stretch of coastline where natural lawn grass extends right to the edge of rocky beaches and the Pacific Ocean. The landscape feels more like Ireland or Scotland than Japan. Starting point of the 1,000-kilometer Michinoku Coastal Trail.",
    "shortDescription": "Unique grass-to-ocean coastline resembling Ireland, starting point of the Michinoku Trail.",
    "lat": 40.5,
    "lng": 141.62
  },
  {
    "name": "Suzumigaoka Hachiman Shrine",
    "nameJapanese": "鈴ヶ岡八幡宮",
    "city": "Soma",
    "prefecture": "Fukushima",
    "region": "Tohoku",
    "category": "shrine",
    "description": "A shrine reached through parallel rows of cherry trees, with a massive ginkgo tree that turns vivid yellow in autumn. All buildings are designated Important Cultural Properties, yet the shrine receives almost no visitors outside local worshippers.",
    "shortDescription": "Important Cultural Property shrine with spectacular autumn ginkgo, visited only by locals.",
    "lat": 37.8,
    "lng": 140.92
  },
  {
    "name": "Todoroki Valley",
    "nameJapanese": "等々力渓谷",
    "city": "Setagaya",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "nature",
    "description": "Tokyo's only natural ravine, stretching about one kilometer along the Yazawa River in residential Setagaya. A boardwalk path winds past moss-covered stone walls, cave tombs from the Kofun period, and a hidden Japanese garden.",
    "shortDescription": "Tokyo's only natural ravine — a hidden gorge with ancient cave tombs in residential Setagaya.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Nezu Shrine",
    "nameJapanese": "根津神社",
    "city": "Bunkyo",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "shrine",
    "description": "One of Tokyo's oldest shrines, over 1,900 years old, with striking vermillion torii gate tunnels reminiscent of Fushimi Inari but with far fewer crowds. The azalea garden features over 3,000 bushes that bloom spectacularly each spring.",
    "shortDescription": "1,900-year-old shrine with Fushimi Inari-style torii tunnels and 3,000 azalea bushes.",
    "lat": 35.7206,
    "lng": 139.7619
  },
  {
    "name": "Gotoku-ji Temple",
    "nameJapanese": "豪徳寺",
    "city": "Setagaya",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "temple",
    "description": "Known as the 'Cat Temple' and said to be the birthplace of the maneki-neko. Hundreds of white cat figurines are arranged across the grounds, left as offerings by visitors whose wishes were granted.",
    "shortDescription": "Birthplace of the maneki-neko with hundreds of white cat figurines across serene Zen grounds.",
    "lat": 35.6495,
    "lng": 139.6365
  },
  {
    "name": "Kiyosumi Garden",
    "nameJapanese": "清澄庭園",
    "city": "Koto",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "garden",
    "description": "A meticulously designed Meiji-era strolling garden with stepping stones across koi-filled ponds and rocks sourced from across Japan. The surrounding Kiyosumi-Shirakawa neighborhood has become a hub for artisan coffee roasters.",
    "shortDescription": "Meiji-era strolling garden with stepping stones over koi ponds in Tokyo's best coffee district.",
    "lat": 35.6806,
    "lng": 139.7994
  },
  {
    "name": "Yanaka District",
    "nameJapanese": "谷中",
    "city": "Taito",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "landmark",
    "description": "One of the few Tokyo neighborhoods that survived WWII bombing, preserving Edo-era wooden architecture, over 70 historic temples, and family-run craft shops. Yanaka Ginza shopping street offers old-school Tokyo street food.",
    "shortDescription": "Rare WWII-surviving neighborhood with Edo-era architecture, 70+ temples, and old-school street food.",
    "lat": 35.7267,
    "lng": 139.7677
  },
  {
    "name": "Kagurazaka",
    "nameJapanese": "神楽坂",
    "city": "Shinjuku",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "landmark",
    "description": "Often called 'Tokyo's Little Paris,' this former geisha district blends Japanese and French culture. Cobblestone alleys wind between exclusive ryotei restaurants, independent boutiques, and French patisseries.",
    "shortDescription": "Former geisha district blending Japanese and French culture along cobblestone alleys.",
    "lat": 35.7026,
    "lng": 139.741
  },
  {
    "name": "Mount Mitake",
    "nameJapanese": "御岳山",
    "city": "Ome",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "mountain",
    "description": "A sacred mountain within Tokyo's western borders, reachable by cable car. Ancient cedar-lined pilgrimage trails lead to Musashi-Mitake Shrine at the summit, with traditional pilgrim lodges still operating.",
    "shortDescription": "Sacred pilgrimage mountain within Tokyo with ancient cedar trails and summit shrine lodgings.",
    "lat": 35.7983,
    "lng": 139.1497
  },
  {
    "name": "Nippara Limestone Cave",
    "nameJapanese": "日原鍾乳洞",
    "city": "Okutama",
    "prefecture": "Tokyo",
    "region": "Kanto",
    "category": "nature",
    "description": "An 800-meter limestone cave system in western Tokyo's mountains, featuring ancient stalactites, stalagmites, and otherworldly rock formations. Part of Chichibu-Tama-Kai National Park and accessible by public transit.",
    "shortDescription": "Massive limestone cave system with ancient formations, surprisingly accessible within Tokyo.",
    "lat": 35.8378,
    "lng": 139.0547
  },
  {
    "name": "Sarushima Island",
    "nameJapanese": "猿島",
    "city": "Yokosuka",
    "prefecture": "Kanagawa",
    "region": "Kanto",
    "category": "landmark",
    "description": "An uninhabited island fortress in Tokyo Bay with atmospheric ruins from its military past — brick tunnels, abandoned barracks, and ammunition depots all being slowly reclaimed by dense forest. The only naturally formed island in Tokyo Bay.",
    "shortDescription": "Uninhabited fortress island in Tokyo Bay with vine-covered military ruins reclaimed by forest.",
    "lat": 35.2883,
    "lng": 139.7475
  },
  {
    "name": "Hokoku-ji Temple",
    "nameJapanese": "報国寺",
    "city": "Kamakura",
    "prefecture": "Kanagawa",
    "region": "Kanto",
    "category": "temple",
    "description": "A Rinzai Zen temple in Kamakura famous for its bamboo grove of over 2,000 moso bamboo stalks. A traditional tea house within the grove serves matcha surrounded by towering bamboo — an intimate alternative to Kyoto's Arashiyama.",
    "shortDescription": "Zen temple with 2,000 bamboo stalks and an in-grove matcha tea house, rivaling Arashiyama.",
    "lat": 35.3152,
    "lng": 139.5611
  },
  {
    "name": "Zeniarai Benten Shrine",
    "nameJapanese": "銭洗弁財天宇賀福神社",
    "city": "Kamakura",
    "prefecture": "Kanagawa",
    "region": "Kanto",
    "category": "shrine",
    "description": "A unique shrine nestled inside a cave in Kamakura's hills, reached through a tunnel carved into rock. Local belief holds that washing your money in the sacred spring water will double your fortune.",
    "shortDescription": "Cave shrine in Kamakura where washing money in sacred spring water is said to double fortune.",
    "lat": 35.3244,
    "lng": 139.5376
  },
  {
    "name": "Nagatoro",
    "nameJapanese": "長瀞",
    "city": "Nagatoro",
    "prefecture": "Saitama",
    "region": "Kanto",
    "category": "nature",
    "description": "A riverside town where the Arakawa River has carved dramatic rock formations called Iwadatami ('rock tatami mats') — flat, layered geological formations. Traditional wooden boat rides navigate the rapids through autumn foliage.",
    "shortDescription": "River town with dramatic 'rock tatami' formations and traditional wooden rapid-boat rides.",
    "lat": 36.1133,
    "lng": 139.1128
  },
  {
    "name": "Chichibu Shrine",
    "nameJapanese": "秩父神社",
    "city": "Chichibu",
    "prefecture": "Saitama",
    "region": "Kanto",
    "category": "shrine",
    "description": "A 2,000-year-old shrine with intricate carvings, anchoring the 34-temple Chichibu Pilgrimage Circuit. The town hosts the spectacular Chichibu Night Festival each December, one of Japan's top three float festivals.",
    "shortDescription": "2,000-year-old shrine anchoring a pilgrimage circuit with one of Japan's top three float festivals.",
    "lat": 35.9917,
    "lng": 139.0856
  },
  {
    "name": "Mashiko",
    "nameJapanese": "益子",
    "city": "Mashiko",
    "prefecture": "Tochigi",
    "region": "Kanto",
    "category": "landmark",
    "description": "A pottery town of 20,000 that was home to legendary potter Shoji Hamada and the mingei folk craft movement. Hundreds of active kilns and workshops operate alongside Saimyo-ji Temple's rare 16th-century three-story pagoda.",
    "shortDescription": "Living pottery village of the mingei craft movement with hundreds of active kilns and workshops.",
    "lat": 36.4669,
    "lng": 140.0964
  },
  {
    "name": "Yunishigawa Onsen",
    "nameJapanese": "湯西川温泉",
    "city": "Nikko",
    "prefecture": "Tochigi",
    "region": "Kanto",
    "category": "onsen",
    "description": "A hidden hot spring village north of Nikko, established by defeated Heike clan warriors after their 12th-century defeat. In winter, the Kamakura Festival fills the riverside with hundreds of candlelit snow houses.",
    "shortDescription": "Hot spring village founded by exiled Heike warriors with a candlelit winter snow house festival.",
    "lat": 36.9358,
    "lng": 139.6658
  },
  {
    "name": "Ashikaga Flower Park",
    "nameJapanese": "あしかがフラワーパーク",
    "city": "Ashikaga",
    "prefecture": "Tochigi",
    "region": "Kanto",
    "category": "park",
    "description": "Home to a 150-year-old Great Wisteria tree that inspired 'Demon Slayer' scenes. In spring, tunnels of cascading purple, pink, white, and yellow wisteria create an otherworldly canopy. The winter LED illumination recreating the blooms is equally spectacular.",
    "shortDescription": "150-year-old wisteria tree with cascading bloom tunnels that inspired Demon Slayer scenes.",
    "lat": 36.3148,
    "lng": 139.5196
  },
  {
    "name": "Ikaho Onsen",
    "nameJapanese": "伊香保温泉",
    "city": "Shibukawa",
    "prefecture": "Gunma",
    "region": "Kanto",
    "category": "onsen",
    "description": "A nostalgic hot spring town built around a famous stone stairway of 365 steps, lined with traditional shops and ryokan. The iron-rich 'golden waters' and vertical theatrical character make it unlike any other onsen town.",
    "shortDescription": "Nostalgic onsen town built around 365 stone steps with iron-rich golden thermal waters.",
    "lat": 36.493,
    "lng": 138.9312
  },
  {
    "name": "Takasaki Byakue Daikannon",
    "nameJapanese": "高崎白衣大観音",
    "city": "Takasaki",
    "prefecture": "Gunma",
    "region": "Kanto",
    "category": "landmark",
    "description": "A 42-meter-tall white Kannon statue on a hilltop, built in 1936, with an observation deck at the shoulders. The city is also the production center for daruma dolls, with nearby Shorinzan Daruma-ji temple dedicated to them.",
    "shortDescription": "Climbable 42-meter Kannon statue overlooking Japan's daruma doll production capital.",
    "lat": 36.3117,
    "lng": 139.0278
  },
  {
    "name": "Kairaku-en Garden",
    "nameJapanese": "偕楽園",
    "city": "Mito",
    "prefecture": "Ibaraki",
    "region": "Kanto",
    "category": "garden",
    "description": "One of Japan's Three Great Gardens, established in 1842, famous for 3,000 plum trees of 100 varieties blooming from late February through March. Despite its ranking, it receives far fewer international visitors than Kenroku-en.",
    "shortDescription": "One of Japan's Three Great Gardens with 3,000 plum trees, yet surprisingly uncrowded.",
    "lat": 36.3814,
    "lng": 140.4517
  },
  {
    "name": "Hida Furukawa",
    "nameJapanese": "飛騨古川",
    "city": "Hida",
    "prefecture": "Gifu",
    "region": "Chubu",
    "category": "landmark",
    "description": "A quieter sibling to nearby Takayama with preserved Edo-era merchant houses and white-walled storehouses lining koi-filled canals. Known as the real-life inspiration for the anime film 'Your Name.'",
    "shortDescription": "Quiet Edo-era canal town with koi-filled waterways, the real-life setting of 'Your Name.'",
    "lat": 36.2389,
    "lng": 137.1864
  },
  {
    "name": "Gokayama",
    "nameJapanese": "五箇山",
    "city": "Nanto",
    "prefecture": "Toyama",
    "region": "Chubu",
    "category": "landmark",
    "description": "A UNESCO World Heritage Site with the same gassho-zukuri thatched farmhouses as Shirakawa-go but dramatically quieter. Some farmhouses operate as minshuku guesthouses where visitors can sleep under the massive thatched roofs.",
    "shortDescription": "UNESCO thatched-roof village like Shirakawa-go but with a fraction of the visitors.",
    "lat": 36.4167,
    "lng": 136.9167
  },
  {
    "name": "Gujo Hachiman",
    "nameJapanese": "郡上八幡",
    "city": "Gujo",
    "prefecture": "Gifu",
    "region": "Chubu",
    "category": "landmark",
    "description": "A castle town famous for crystal-clear waterways running through the streets. Hosts the Gujo Odori — a 400-year-old bon dance festival running 32 nights each summer with four all-night dance sessions anyone can join.",
    "shortDescription": "Water town with streams running through streets and a 400-year-old 32-night dance festival.",
    "lat": 35.7486,
    "lng": 136.9642
  },
  {
    "name": "Okuhida Onsen Villages",
    "nameJapanese": "奥飛騨温泉郷",
    "city": "Takayama",
    "prefecture": "Gifu",
    "region": "Chubu",
    "category": "onsen",
    "description": "Five distinct hot spring villages in the Northern Alps containing more open-air baths than anywhere else in Japan. The nearby Shinhotaka Ropeway offers a double-decker gondola ride to 2,156 meters with panoramic Alpine views.",
    "shortDescription": "Highest concentration of open-air baths in Japan, nestled in the Northern Alps.",
    "lat": 36.2833,
    "lng": 137.5833
  },
  {
    "name": "Shosenkyo Gorge",
    "nameJapanese": "昇仙峡",
    "city": "Kofu",
    "prefecture": "Yamanashi",
    "region": "Chubu",
    "category": "nature",
    "description": "One of Japan's most dramatic gorges, carved through granite by the Arakawa River, with a 4-kilometer trail leading to the 30-meter Sengataki Waterfall. Voted Japan's most beautiful gorge in multiple surveys.",
    "shortDescription": "Japan's most-voted beautiful gorge with granite cliffs and a 30-meter waterfall near Kofu.",
    "lat": 35.7625,
    "lng": 138.5528
  },
  {
    "name": "Bessho Onsen",
    "nameJapanese": "別所温泉",
    "city": "Ueda",
    "prefecture": "Nagano",
    "region": "Chubu",
    "category": "onsen",
    "description": "Called the 'Kamakura of Shinshu,' this hot spring town has over 1,400 years of history. Anraku-ji temple houses Japan's only octagonal three-story pagoda, a National Treasure. Three public bathhouses charge just a few hundred yen.",
    "shortDescription": "1,400-year-old hot spring town with Japan's only octagonal three-story pagoda National Treasure.",
    "lat": 36.3539,
    "lng": 138.1578
  },
  {
    "name": "Shirahone Onsen",
    "nameJapanese": "白骨温泉",
    "city": "Matsumoto",
    "prefecture": "Nagano",
    "region": "Chubu",
    "category": "onsen",
    "description": "A secluded mountain hot spring near Matsumoto celebrated for its rare milky-white mineral waters that shift between white and blue-green. A local saying promises 'three days of bathing here will cure three years of ailments.'",
    "shortDescription": "Secluded mountain onsen with rare milky-white waters that shift between white and blue-green.",
    "lat": 36.1694,
    "lng": 137.6375
  },
  {
    "name": "Togakushi",
    "nameJapanese": "戸隠",
    "city": "Nagano",
    "prefecture": "Nagano",
    "region": "Chubu",
    "category": "shrine",
    "description": "A highland shrine complex associated with the hiding place of sun goddess Amaterasu. The 2-kilometer approach to Togakushi Okusha through 400-year-old cedar trees is one of Japan's most atmospheric walks. Also famous for distinctive soba noodles.",
    "shortDescription": "Mythological shrine with a 2km approach through 400-year-old cedars, famous for soba noodles.",
    "lat": 36.7581,
    "lng": 138.0678
  },
  {
    "name": "Tunnel of Light",
    "nameJapanese": "清津峡渓谷トンネル",
    "city": "Tokamachi",
    "prefecture": "Niigata",
    "region": "Chubu",
    "category": "landmark",
    "description": "A 750-meter tunnel alongside one of Japan's three great gorges, transformed by MAD Architects into art installations. It culminates in a reflective water pool mirroring the gorge entrance — one of Japan's most photographed art spaces.",
    "shortDescription": "Art-transformed gorge tunnel culminating in a mirror-pool reflecting dramatic cliff scenery.",
    "lat": 36.8883,
    "lng": 138.7239
  },
  {
    "name": "Tsubame Onsen",
    "nameJapanese": "燕温泉",
    "city": "Myoko",
    "prefecture": "Niigata",
    "region": "Chubu",
    "category": "onsen",
    "description": "A remote high-altitude hot spring village in Joshin'etsukogen National Park with rare milky turquoise waters. Two free open-air baths sit dramatically at the base of waterfalls surrounded by alpine wilderness.",
    "shortDescription": "Free open-air baths with milky turquoise water at the base of mountain waterfalls.",
    "lat": 36.8667,
    "lng": 138.1333
  },
  {
    "name": "Sado Island",
    "nameJapanese": "佐渡島",
    "city": "Sado",
    "prefecture": "Niigata",
    "region": "Chubu",
    "category": "nature",
    "description": "A large island once used for political exile and gold mining, now home to the Toki ibis conservation program, dramatic Senkaku Bay scenery, and the Kodo Taiko drumming community. Traditional tub boats can still be ridden at Ogi Port.",
    "shortDescription": "Former exile island with gold mines, endangered ibis, taiko drums, and traditional tub boats.",
    "lat": 38.0333,
    "lng": 138.3667
  },
  {
    "name": "Nishi Chaya District",
    "nameJapanese": "にし茶屋街",
    "city": "Kanazawa",
    "prefecture": "Ishikawa",
    "region": "Chubu",
    "category": "landmark",
    "description": "The quietest of Kanazawa's three geisha districts with the highest number of active geiko. In evenings, shamisen practice drifts from teahouse walls. The adjacent Teramachi district contains around 70 historic temples.",
    "shortDescription": "Kanazawa's quietest geisha district where shamisen music drifts from active teahouses.",
    "lat": 36.5597,
    "lng": 136.6481
  },
  {
    "name": "Shiroyone Senmaida",
    "nameJapanese": "白米千枚田",
    "city": "Wajima",
    "prefecture": "Ishikawa",
    "region": "Chubu",
    "category": "viewpoint",
    "description": "A cascade of 1,004 tiny rice paddies descending directly to the Sea of Japan coast. In autumn and winter, 25,000 solar LEDs illuminate the terraces. Sunset views of paddies reflecting orange sky against the sea are extraordinary.",
    "shortDescription": "1,004 rice paddies cascading to the sea, illuminated by 25,000 LEDs in autumn and winter.",
    "lat": 37.4194,
    "lng": 136.8444
  },
  {
    "name": "Showagawa Gorge",
    "nameJapanese": "庄川峡",
    "city": "Tonami",
    "prefecture": "Toyama",
    "region": "Chubu",
    "category": "nature",
    "description": "A dramatic mountain gorge navigated by sightseeing boat, culminating at Omaki Onsen — a hot spring ryokan accessible only by water with 1,100 years of history. One of the very few onsen in Japan unreachable by road.",
    "shortDescription": "Mountain gorge with a boat-only hot spring ryokan dating back 1,100 years.",
    "lat": 36.5167,
    "lng": 136.9333
  },
  {
    "name": "Eihei-ji Temple",
    "nameJapanese": "永平寺",
    "city": "Eiheiji",
    "prefecture": "Fukui",
    "region": "Chubu",
    "category": "temple",
    "description": "The head temple of Soto Zen Buddhism, founded in 1244, where 150 monks still live in strict daily practice. Seventy buildings are connected by covered corridors winding up a mountainside through ancient cedar forests. Visitors can participate in zazen meditation.",
    "shortDescription": "Active Soto Zen head temple where 150 monks train daily among 70 cedar-forest buildings.",
    "lat": 36.0892,
    "lng": 136.3625
  },
  {
    "name": "Fukui Prefectural Dinosaur Museum",
    "nameJapanese": "福井県立恐竜博物館",
    "city": "Katsuyama",
    "prefecture": "Fukui",
    "region": "Chubu",
    "category": "museum",
    "description": "One of the world's top three dinosaur museums, built near Japan's richest fossil deposits. Contains over 40 complete dinosaur skeletons and life-size animatronic dinosaurs. The nearby outdoor quarry allows visitors to dig for real fossils.",
    "shortDescription": "World top-three dinosaur museum with 40+ skeletons and a real fossil-digging quarry.",
    "lat": 36.0706,
    "lng": 136.5447
  },
  {
    "name": "Dogashima Coast",
    "nameJapanese": "堂ヶ島",
    "city": "Nishi-Izu",
    "prefecture": "Shizuoka",
    "region": "Chubu",
    "category": "nature",
    "description": "Dramatically sculpted coastline on western Izu featuring sea caves, natural rock arches, and tide-dependent islands. Boat tours navigate through the Tensodo sea cave where sunlight pierces through a ceiling hole to illuminate turquoise water.",
    "shortDescription": "Sculpted coastline with a sea cave where sunlight pierces through rock to illuminate turquoise water.",
    "lat": 34.7853,
    "lng": 138.7639
  },
  {
    "name": "Shuzenji Onsen",
    "nameJapanese": "修善寺温泉",
    "city": "Izu",
    "prefecture": "Shizuoka",
    "region": "Chubu",
    "category": "onsen",
    "description": "One of the oldest hot spring towns on the Izu Peninsula, centered around Shuzen-ji temple founded in 807 by Kobo Daishi. Bamboo-lined paths connect traditional ryokan along the Katsura River. Featured in works by Natsume Soseki.",
    "shortDescription": "1,200-year-old hot spring town on the Izu Peninsula, founded by the monk Kobo Daishi.",
    "lat": 34.9714,
    "lng": 138.9294
  },
  {
    "name": "Otagi Nenbutsu-ji",
    "nameJapanese": "愛宕念仏寺",
    "city": "Kyoto",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "temple",
    "description": "A hillside temple featuring over 1,200 rakan stone statues, each carved by a different amateur artist. Every statue has a completely unique expression, and many are now beautifully moss-covered. Located beyond the main Arashiyama tourist zone.",
    "shortDescription": "Hillside temple with 1,200 unique moss-covered stone statues carved by amateur artists.",
    "lat": 35.0289,
    "lng": 135.6597
  },
  {
    "name": "Komyo-in",
    "nameJapanese": "光明院",
    "city": "Kyoto",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "temple",
    "description": "A tiny sub-temple of Tofuku-ji housing the Hashin-tei garden designed by legendary landscape architect Shigemori Mirei. Interconnected rooms offer different perspectives into a dry landscape garden — one of the most serene spaces in Kyoto.",
    "shortDescription": "Hidden Tofuku-ji sub-temple with a Shigemori Mirei Zen garden experienced in near-solitude.",
    "lat": 34.9762,
    "lng": 135.7725
  },
  {
    "name": "Gio-ji",
    "nameJapanese": "祇王寺",
    "city": "Kyoto",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "temple",
    "description": "A small thatched-roof nunnery with a sublime moss garden of over 120 species under a maple canopy. Connected to a tragic love story from the Tale of the Heike. The moss garden rivals famous Saiho-ji but requires no reservation.",
    "shortDescription": "Thatched-roof nunnery with 120 moss species rivaling famous Saiho-ji — no reservation needed.",
    "lat": 35.0252,
    "lng": 135.6696
  },
  {
    "name": "Shisen-do",
    "nameJapanese": "詩仙堂",
    "city": "Kyoto",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "temple",
    "description": "A 17th-century hermitage built by a retired samurai-poet, featuring the first-ever decorative shishi-odoshi bamboo water knocker. The main hall displays portraits of 36 Chinese poets painted by Kano Tan'yu.",
    "shortDescription": "Samurai-poet's hermitage with the original shishi-odoshi and exquisite Zen garden design.",
    "lat": 35.0444,
    "lng": 135.7936
  },
  {
    "name": "Honen-in",
    "nameJapanese": "法然院",
    "city": "Kyoto",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "temple",
    "description": "A small temple near the Philosopher's Path with a rustic thatched gate and two raised-sand platforms with seasonal patterns. Novelist Junichiro Tanizaki is buried in the quiet cemetery among moss-covered grounds.",
    "shortDescription": "Philosopher's Path temple with a thatched gate framing seasonally patterned raked-sand gardens.",
    "lat": 35.0223,
    "lng": 135.7941
  },
  {
    "name": "Sanzen-in",
    "nameJapanese": "三千院",
    "city": "Ohara",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "temple",
    "description": "A Tendai sect temple in the rural mountain village of Ohara, featuring centuries-old moss gardens concealing tiny laughing warabe-jizo statues. Two distinct gardens offer different contemplative experiences.",
    "shortDescription": "Mountain temple in rural Ohara with moss gardens hiding tiny laughing Buddha statues.",
    "lat": 35.1203,
    "lng": 135.8347
  },
  {
    "name": "Adashino Nenbutsu-ji",
    "nameJapanese": "化野念仏寺",
    "city": "Kyoto",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "temple",
    "description": "A hillside temple with approximately 8,000 carved stone Buddha memorial statues arranged across its grounds. These stones represent souls of the deceased from when this area was historically a burial ground. The annual Sento Kuyo festival lights candles among the statues.",
    "shortDescription": "Haunting hillside temple with 8,000 stone Buddha memorials from an ancient burial ground.",
    "lat": 35.0261,
    "lng": 135.6632
  },
  {
    "name": "Fushimi Sake District",
    "nameJapanese": "伏見酒蔵",
    "city": "Fushimi",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "landmark",
    "description": "A working sake brewing district along the willow-lined Horikawa River with nearly 40 breweries. Built around natural underground springs producing water recognized as one of Japan's 100 best, giving Fushimi sake its distinctive soft character.",
    "shortDescription": "Working sake district with 40 breweries along willow-lined canals, built over Japan's finest waters.",
    "lat": 34.9342,
    "lng": 135.7648
  },
  {
    "name": "Kibune",
    "nameJapanese": "貴船",
    "city": "Kibune",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "shrine",
    "description": "A mystical mountain shrine village with a 1,600-year-old water deity shrine. In summer, restaurants build kawadoko platforms directly over the Kibune River where diners eat kaiseki cuisine cooled by river breezes — temperatures run 10 degrees below downtown Kyoto.",
    "shortDescription": "Mountain shrine village with summer river-platform dining 10 degrees cooler than central Kyoto.",
    "lat": 35.1226,
    "lng": 135.7631
  },
  {
    "name": "Wazuka",
    "nameJapanese": "和束",
    "city": "Wazuka",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "nature",
    "description": "A rural town south of Kyoto where terraced tea fields stretch across emerald-green hills, producing some of Japan's finest matcha and sencha. Unlike nearby Uji, Wazuka offers cycling through plantations and tea-picking workshops.",
    "shortDescription": "Terraced tea fields producing Japan's finest matcha, with cycling and picking workshops.",
    "lat": 34.7956,
    "lng": 135.9008
  },
  {
    "name": "Keihoku",
    "nameJapanese": "京北",
    "city": "Keihoku",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "nature",
    "description": "A peaceful mountain retreat in far northern Kyoto with traditional thatched-roof farmhouses, quiet riverside paths, and hand-tended tea plantations. Feels centuries removed from modern Japan.",
    "shortDescription": "Remote northern Kyoto mountain retreat with thatched farmhouses and untouched rural atmosphere.",
    "lat": 35.1667,
    "lng": 135.7
  },
  {
    "name": "Amanohashidate",
    "nameJapanese": "天橋立",
    "city": "Miyazu",
    "prefecture": "Kyoto",
    "region": "Kansai",
    "category": "viewpoint",
    "description": "A 3.6-kilometer pine-covered sandbar spanning Miyazu Bay, one of Japan's three most scenic views. Nearly 8,000 pine trees line the isthmus. Viewed upside down through your legs, the sandbar appears to float in the sky like a bridge to heaven.",
    "shortDescription": "One of Japan's three great views — a pine-covered sandbar that appears to float when viewed inverted.",
    "lat": 35.5723,
    "lng": 135.1898
  },
  {
    "name": "Nakazakicho",
    "nameJapanese": "中崎町",
    "city": "Osaka",
    "prefecture": "Osaka",
    "region": "Kansai",
    "category": "landmark",
    "description": "A bohemian neighborhood of narrow alleys and Showa-era wooden houses converted into independent cafes, vintage shops, and art galleries. Sandwiched between skyscrapers near Umeda, it feels like stepping into 1960s Japan.",
    "shortDescription": "Bohemian 1960s-era neighborhood of converted wooden houses hidden between Osaka skyscrapers.",
    "lat": 34.7089,
    "lng": 135.5065
  },
  {
    "name": "Karahori Shopping Street",
    "nameJapanese": "空堀商店街",
    "city": "Osaka",
    "prefecture": "Osaka",
    "region": "Kansai",
    "category": "market",
    "description": "An 800-meter shopping street that survived WWII bombing, preserving Showa-era atmosphere and original machiya townhouses. Once a protective moat for Osaka Castle, now blending traditional and contemporary culture.",
    "shortDescription": "WWII-surviving 800-meter shopping street with original machiya townhouses near Osaka Castle.",
    "lat": 34.6741,
    "lng": 135.5207
  },
  {
    "name": "Hozenji Yokocho",
    "nameJapanese": "法善寺横丁",
    "city": "Osaka",
    "prefecture": "Osaka",
    "region": "Kansai",
    "category": "landmark",
    "description": "Two parallel stone-paved alleys behind Dotonbori with about 60 small restaurants. Features the moss-covered Mizukake Fudo statue — a Buddhist figure blanketed in vivid green moss from centuries of water-splashing wishes.",
    "shortDescription": "Hidden stone alleys behind Dotonbori with a centuries-old moss-covered Buddhist wishing statue.",
    "lat": 34.6685,
    "lng": 135.5033
  },
  {
    "name": "Minoo Park",
    "nameJapanese": "箕面公園",
    "city": "Minoo",
    "prefecture": "Osaka",
    "region": "Kansai",
    "category": "nature",
    "description": "A forested valley featuring the 33-meter Minoo Falls at the end of a 3-kilometer trail. In autumn, vendors sell momiji tempura — deep-fried maple leaves, a snack unique to this location. Less than 30 minutes from Umeda.",
    "shortDescription": "Forest valley with a 33-meter waterfall and unique deep-fried maple leaf snacks near Osaka.",
    "lat": 34.8539,
    "lng": 135.4702
  },
  {
    "name": "Tanzan Shrine",
    "nameJapanese": "談山神社",
    "city": "Sakurai",
    "prefecture": "Nara",
    "region": "Kansai",
    "category": "shrine",
    "description": "A mountainside shrine housing the world's only 13-story wooden pagoda, surrounded by 3,000 maple trees that turn fiery red in November. Enshrines Fujiwara no Kamatari, who launched the 7th-century Taika Reform.",
    "shortDescription": "Mountain shrine with the world's only 13-story wooden pagoda amid 3,000 fiery autumn maples.",
    "lat": 34.4574,
    "lng": 135.8577
  },
  {
    "name": "Hasedera Temple",
    "nameJapanese": "長谷寺",
    "city": "Sakurai",
    "prefecture": "Nara",
    "region": "Kansai",
    "category": "temple",
    "description": "Known as the 'Temple of Flowers,' built in 686. A dramatic enclosed stairway of 399 steps rises to the main hall past stone lanterns and seasonal flowers. Referenced by Heian literary figures Sei Shonagon and Murasaki Shikibu.",
    "shortDescription": "7th-century 'Temple of Flowers' with a dramatic 399-step enclosed stairway through seasonal blooms.",
    "lat": 34.4535,
    "lng": 135.9009
  },
  {
    "name": "Muro-ji",
    "nameJapanese": "室生寺",
    "city": "Uda",
    "prefecture": "Nara",
    "region": "Kansai",
    "category": "temple",
    "description": "A deep-forest temple historically known as 'women's Koya-san' because it welcomed women when Mount Koya barred them. Its five-story pagoda, the smallest outdoor pagoda in Japan at 16 meters, stands in a hauntingly atmospheric cedar forest.",
    "shortDescription": "'Women's Koya-san' temple with Japan's smallest outdoor pagoda in a mystical cedar forest.",
    "lat": 34.5329,
    "lng": 136.0372
  },
  {
    "name": "Mount Yoshino",
    "nameJapanese": "吉野山",
    "city": "Yoshino",
    "prefecture": "Nara",
    "region": "Kansai",
    "category": "temple",
    "description": "A UNESCO World Heritage sacred mountain with 30,000 cherry trees of 200 varieties planted over 1,300 years. At its heart stands Kinpusen-ji, the headquarters of Shugendo mountain worship with Japan's second-largest wooden structure.",
    "shortDescription": "Sacred mountain with 30,000 cherry trees and the headquarters of Shugendo mountain worship.",
    "lat": 34.3659,
    "lng": 135.8593
  },
  {
    "name": "Tsubosaka-dera",
    "nameJapanese": "壷阪寺",
    "city": "Takatori",
    "prefecture": "Nara",
    "region": "Kansai",
    "category": "temple",
    "description": "A Buddhist temple offering a unique fusion of Indian and Japanese architectural styles. Deep connections to relief work for Hansen's Disease patients in India resulted in distinctive stone carvings and architectural elements by Indian artisans.",
    "shortDescription": "Unique Indo-Japanese temple with architectural elements donated by Indian artisans.",
    "lat": 34.4399,
    "lng": 135.7841
  },
  {
    "name": "Mount Maya",
    "nameJapanese": "摩耶山 掬星台",
    "city": "Kobe",
    "prefecture": "Hyogo",
    "region": "Kansai",
    "category": "viewpoint",
    "description": "A mountaintop observatory offering Japan's finest night view — the '10 million dollar view' — with both Osaka and Kobe city lights below. The approach features a fluorescent walkway glowing in a milky-way constellation pattern.",
    "shortDescription": "Japan's finest night view observatory with a glowing constellation-pattern walkway approach.",
    "lat": 34.7283,
    "lng": 135.1824
  },
  {
    "name": "Kobe Nada Sake District",
    "nameJapanese": "灘五郷",
    "city": "Kobe",
    "prefecture": "Hyogo",
    "region": "Kansai",
    "category": "landmark",
    "description": "Japan's largest sake-producing region, where Shushinkan Brewery (founded 1751) produces Fukuju sake served at the Nobel Prize dinner. The district benefits from miyamizu spring water and Rokko mountain rice.",
    "shortDescription": "Japan's largest sake region with a 1751 brewery whose sake is served at Nobel Prize dinners.",
    "lat": 34.7148,
    "lng": 135.253
  },
  {
    "name": "Arima Onsen",
    "nameJapanese": "有馬温泉",
    "city": "Kobe",
    "prefecture": "Hyogo",
    "region": "Kansai",
    "category": "onsen",
    "description": "One of Japan's oldest hot spring resorts with over 1,000 years of history, just 30 minutes from Kobe. Features two distinctive water types: kinsen (golden, iron-rich) and ginsen (silver, clear and carbonated).",
    "shortDescription": "1,000-year-old onsen near Kobe with rare dual water types — golden iron-rich and silver carbonated.",
    "lat": 34.7975,
    "lng": 135.249
  },
  {
    "name": "Tomogashima Islands",
    "nameJapanese": "友ヶ島",
    "city": "Wakayama",
    "prefecture": "Wakayama",
    "region": "Kansai",
    "category": "nature",
    "description": "Uninhabited islands with abandoned Meiji-era military fortifications overgrown with vegetation, compared to Studio Ghibli's 'Castle in the Sky.' During WWII they were a secret military base erased from all maps.",
    "shortDescription": "Uninhabited islands with Ghibli-esque overgrown military ruins from a secret WWII base.",
    "lat": 34.2818,
    "lng": 135.0609
  },
  {
    "name": "Yunomine Onsen",
    "nameJapanese": "湯の峰温泉",
    "city": "Tanabe",
    "prefecture": "Wakayama",
    "region": "Kansai",
    "category": "onsen",
    "description": "Discovered 1,800 years ago, with the world's only UNESCO-registered onsen — Tsubo-yu, a tiny rock bath where water changes color seven times daily. Pilgrims have used its waters for purification before Kumano Hongu Taisha for over 1,000 years.",
    "shortDescription": "World's only UNESCO-registered onsen where water changes color seven times daily.",
    "lat": 33.8537,
    "lng": 135.728
  },
  {
    "name": "Kada",
    "nameJapanese": "加太",
    "city": "Wakayama",
    "prefecture": "Wakayama",
    "region": "Kansai",
    "category": "shrine",
    "description": "A small coastal fishing town with Kishu Toshogu Shrine, said to be as impressive as the famous Toshogu in Nikko but with virtually no visitors. Rocky outcrops and panoramic ocean views complete the experience.",
    "shortDescription": "Quiet fishing town with a Nikko-rivaling Toshogu shrine and almost no visitors.",
    "lat": 34.2833,
    "lng": 135.0667
  },
  {
    "name": "Hashigui-iwa Rocks",
    "nameJapanese": "橋杭岩",
    "city": "Kushimoto",
    "prefecture": "Wakayama",
    "region": "Kansai",
    "category": "nature",
    "description": "A dramatic formation where 40 rock pillars stand in a straight line stretching toward an island. Legend says Kobo Daishi began building a bridge overnight but abandoned it at dawn. Stunning at sunrise when silhouetted against the sky.",
    "shortDescription": "40 rock pillars in a mysterious straight line, legendary overnight bridge attempt by Kobo Daishi.",
    "lat": 33.4719,
    "lng": 135.7897
  },
  {
    "name": "Omihachiman",
    "nameJapanese": "近江八幡",
    "city": "Omihachiman",
    "prefecture": "Shiga",
    "region": "Kansai",
    "category": "landmark",
    "description": "A preserved Edo-period merchant town on Lake Biwa's shores, centered on the 4.7-kilometer Hachiman-bori canal lined with white-walled storehouses. Traditional boat cruises pass under charming wooden bridges.",
    "shortDescription": "Edo-period merchant town with traditional canal boat rides through white-walled storehouses.",
    "lat": 35.1286,
    "lng": 136.0978
  },
  {
    "name": "Chomeiji Temple",
    "nameJapanese": "長命寺",
    "city": "Omihachiman",
    "prefecture": "Shiga",
    "region": "Kansai",
    "category": "temple",
    "description": "A mountaintop temple with sweeping Lake Biwa views, accessible via 808 stone steps through cedar forest. The main hall and three-story pagoda perch dramatically on the mountainside overlooking Japan's largest lake.",
    "shortDescription": "Mountaintop temple reached via 808 stone steps with sweeping views over Lake Biwa.",
    "lat": 35.1593,
    "lng": 136.0774
  },
  {
    "name": "Kinomoto",
    "nameJapanese": "木之本",
    "city": "Nagahama",
    "prefecture": "Shiga",
    "region": "Kansai",
    "category": "landmark",
    "description": "A quiet post-town in northern Shiga offering tours of traditional sake and soy sauce breweries with tastings. The town preserves the atmosphere of its days as a stop on the ancient Hokkoku Kaido highway.",
    "shortDescription": "Northern Shiga post-town with sake and soy sauce brewery tours along an ancient highway.",
    "lat": 35.4973,
    "lng": 136.2273
  },
  {
    "name": "Ukimido",
    "nameJapanese": "浮御堂",
    "city": "Otsu",
    "prefecture": "Shiga",
    "region": "Kansai",
    "category": "temple",
    "description": "A small wooden temple built on a jetty extending into Lake Biwa, appearing to float on the water. Particularly ethereal at dawn and dusk, creating one of the lake's most iconic and serene scenes.",
    "shortDescription": "Floating wooden temple on a Lake Biwa jetty, ethereal at dawn and dusk.",
    "lat": 35.0979,
    "lng": 135.8891
  },
  {
    "name": "Maruyama Senmaida",
    "nameJapanese": "丸山千枚田",
    "city": "Kumano",
    "prefecture": "Mie",
    "region": "Kansai",
    "category": "nature",
    "description": "One of Japan's most beautiful rice cultivation sites with 1,340 small paddies arranged on steep mountain terraces. The geometric patterns shift seasonally — flooded sky reflections in spring, vibrant green in summer, golden grain in autumn.",
    "shortDescription": "1,340 rice paddies on steep mountain terraces creating stunning seasonal geometric patterns.",
    "lat": 33.9574,
    "lng": 136.01
  },
  {
    "name": "Sekijuku",
    "nameJapanese": "関宿",
    "city": "Kameyama",
    "prefecture": "Mie",
    "region": "Kansai",
    "category": "landmark",
    "description": "One of the best-preserved post-towns on the old Tokaido highway, with over 200 original Edo-period buildings stretching 1.8 kilometers. Unlike reconstructed tourist towns, Sekijuku's architecture is genuinely original.",
    "shortDescription": "1.8km of 200+ original Edo buildings on the Tokaido highway — Japan's most authentic post-town.",
    "lat": 34.8524,
    "lng": 136.3928
  },
  {
    "name": "Sandankyo Gorge",
    "nameJapanese": "三段峡",
    "city": "Akiota",
    "prefecture": "Hiroshima",
    "region": "Chugoku",
    "category": "nature",
    "description": "A 16-kilometer gorge along the Shibaki River, weaving through untouched forests, cliffs, and waterfalls. Home to approximately one-sixth of Japan's 1,800 moss species with emerald-green river pools ideal for kayaking.",
    "shortDescription": "16km gorge with emerald pools and one-sixth of Japan's moss species, near Hiroshima.",
    "lat": 34.58,
    "lng": 132.18
  },
  {
    "name": "Onomichi Temple Walk",
    "nameJapanese": "尾道",
    "city": "Onomichi",
    "prefecture": "Hiroshima",
    "region": "Chugoku",
    "category": "landmark",
    "description": "A 2.5-kilometer hillside route connecting 25 Buddhist temples, some dating to the 7th century. Cat Alley is a narrow lane populated by friendly stray cats and whimsical cat art installations between panoramic sea views.",
    "shortDescription": "Hillside walk connecting 25 ancient temples with a cat-filled art alley and sea views.",
    "lat": 34.41,
    "lng": 133.2
  },
  {
    "name": "Fukiya Furusato Village",
    "nameJapanese": "吹屋ふるさと村",
    "city": "Takahashi",
    "prefecture": "Okayama",
    "region": "Chugoku",
    "category": "landmark",
    "description": "The only historical settlement in Japan where the entire town is uniformly painted in bengara red iron-oxide pigment. Designated a Japan Heritage Site as the 'Birthplace of Japan Red' with 18th-19th century merchant mansions.",
    "shortDescription": "Japan's only town entirely painted in traditional bengara red pigment — the 'Birthplace of Japan Red.'",
    "lat": 34.88,
    "lng": 133.43
  },
  {
    "name": "Bitchu Matsuyama Castle",
    "nameJapanese": "備中松山城",
    "city": "Takahashi",
    "prefecture": "Okayama",
    "region": "Chugoku",
    "category": "landmark",
    "description": "The only mountain castle in Japan with a surviving original tower, perched at 430 meters. It appears to float above a 'sea of clouds' from October to December. A resident cat named Sanjuro serves as unofficial lord.",
    "shortDescription": "Japan's only original mountain castle, floating above morning clouds with a resident cat lord.",
    "lat": 34.8,
    "lng": 133.62
  },
  {
    "name": "Kurayoshi White Wall District",
    "nameJapanese": "倉吉白壁土蔵群",
    "city": "Kurayoshi",
    "prefecture": "Tottori",
    "region": "Chugoku",
    "category": "landmark",
    "description": "Edo and Meiji-period storehouses lining the Tamagawa River with white plaster upper walls and black cedar lower sections. Now houses sake breweries, soy sauce makers, and cafes in an Important Traditional Architecture Preservation District.",
    "shortDescription": "River-lined Edo storehouses with white plaster walls housing sake breweries and artisan shops.",
    "lat": 35.43,
    "lng": 133.83
  },
  {
    "name": "Uradome Coast",
    "nameJapanese": "浦富海岸",
    "city": "Iwami",
    "prefecture": "Tottori",
    "region": "Chugoku",
    "category": "beach",
    "description": "Dramatic coastline in the San'in Kaigan Geopark featuring cliffs, sea caves, tunnels, and white sand beaches. Ocean visibility reaches 25 meters, making it exceptional for snorkeling and clear-bottomed kayaking.",
    "shortDescription": "Geopark coastline with 25-meter water visibility, sea caves, and white sand beaches.",
    "lat": 35.62,
    "lng": 134.42
  },
  {
    "name": "Mount Daisen",
    "nameJapanese": "大山",
    "city": "Daisen",
    "prefecture": "Tottori",
    "region": "Chugoku",
    "category": "mountain",
    "description": "The tallest mountain in the Chugoku region at 1,729 meters, resembling Mount Fuji from certain angles. Features vast beech forests, steep hiking trails, and a history of mountain asceticism with 170 monks' temples during the 14th-15th centuries.",
    "shortDescription": "Chugoku's tallest peak resembling Mount Fuji, with vast beech forests and ascetic history.",
    "lat": 35.37,
    "lng": 133.54
  },
  {
    "name": "Misasa Onsen",
    "nameJapanese": "三朝温泉",
    "city": "Misasa",
    "prefecture": "Tottori",
    "region": "Chugoku",
    "category": "onsen",
    "description": "An 800-year-old hot spring town with the highest levels of naturally occurring radium in the world. Features a free 24-hour riverside open-air bath. Residents over 90 are reportedly six times the national average.",
    "shortDescription": "800-year-old radium hot spring where locals reportedly live far beyond the national average.",
    "lat": 35.4,
    "lng": 133.86
  },
  {
    "name": "Iwami Ginzan Silver Mine",
    "nameJapanese": "石見銀山",
    "city": "Oda",
    "prefecture": "Shimane",
    "region": "Chugoku",
    "category": "landmark",
    "description": "UNESCO World Heritage Site where one-third of the world's silver was produced in the 16th century. The adjacent Omori town (population ~450) preserves buildings from the 1500s. Visitors can explore original mineshafts.",
    "shortDescription": "UNESCO silver mine that once produced one-third of global silver, with a 1500s-era village.",
    "lat": 35.11,
    "lng": 132.43
  },
  {
    "name": "Tsuwano",
    "nameJapanese": "津和野",
    "city": "Tsuwano",
    "prefecture": "Shimane",
    "region": "Chugoku",
    "category": "landmark",
    "description": "A mountain castle town of under 6,000 people known as the 'Little Kyoto of San'in.' Features an Edo-period samurai district with koi-filled water channels and the only continuously performed Heron Dance in Japan, over 400 years old.",
    "shortDescription": "'Little Kyoto of San'in' with koi-filled samurai streets and a 400-year-old Heron Dance.",
    "lat": 34.47,
    "lng": 131.77
  },
  {
    "name": "Taikodani Inari Shrine",
    "nameJapanese": "太皷谷稲成神社",
    "city": "Tsuwano",
    "prefecture": "Shimane",
    "region": "Chugoku",
    "category": "shrine",
    "description": "One of Japan's five most important Inari shrines with over 1,000 vermillion torii gates creating a 300-meter tunnel up the mountainside. Dedicated uniquely to the return of lost items, with panoramic views from the summit.",
    "shortDescription": "Top-five Inari shrine with 1,000 torii gates up a mountainside — the Fushimi Inari of San'in.",
    "lat": 34.47,
    "lng": 131.77
  },
  {
    "name": "Motonosumi Shrine",
    "nameJapanese": "元乃隅神社",
    "city": "Nagato",
    "prefecture": "Yamaguchi",
    "region": "Chugoku",
    "category": "shrine",
    "description": "123 vermillion torii gates in a dragon-like arrangement over sea bluffs leading down to the Sea of Japan. The offering box is hung at the very top of the torii gate — if your coin lands inside, your wish comes true.",
    "shortDescription": "123 red torii gates snaking over sea cliffs with a coin-toss challenge at the top.",
    "lat": 34.42,
    "lng": 131.19
  },
  {
    "name": "Tawarayama Onsen",
    "nameJapanese": "俵山温泉",
    "city": "Nagato",
    "prefecture": "Yamaguchi",
    "region": "Chugoku",
    "category": "onsen",
    "description": "An 1,100-year-old hot spring town preserving the traditional toji healing culture. Most lodges lack their own baths, so guests walk to public baths in yukata and wooden geta clogs — like stepping into a period film.",
    "shortDescription": "1,100-year-old onsen town where guests walk to baths in yukata and wooden clogs.",
    "lat": 34.3,
    "lng": 131.17
  },
  {
    "name": "Joei-ji Temple",
    "nameJapanese": "常栄寺",
    "city": "Yamaguchi",
    "prefecture": "Yamaguchi",
    "region": "Chugoku",
    "category": "temple",
    "description": "A Zen temple with a 500-year-old dry landscape garden designed by master painter-monk Sesshu. Built around a pond shaped like the Chinese character for 'heart,' with stone arrangements representing turtle and crane islands.",
    "shortDescription": "Zen temple with a 500-year-old Sesshu-designed garden equal to Kyoto's finest — without crowds.",
    "lat": 34.18,
    "lng": 131.47
  },
  {
    "name": "Hiruzen Highland",
    "nameJapanese": "蒜山高原",
    "city": "Maniwa",
    "prefecture": "Okayama",
    "region": "Chugoku",
    "category": "nature",
    "description": "Western Japan's premier highland resort and Japan's largest Jersey cow breeding ground with 2,000 animals grazing across 40-hectare pastures. Features a winery, herb garden, cycling trails, and celebrated Jersey milk soft-serve.",
    "shortDescription": "Highland pastures with 2,000 Jersey cows, cycling trails, and celebrated soft-serve ice cream.",
    "lat": 35.29,
    "lng": 133.65
  },
  {
    "name": "Tateiwa Shrine",
    "nameJapanese": "立岩神社",
    "city": "Shimane",
    "prefecture": "Shimane",
    "region": "Chugoku",
    "category": "shrine",
    "description": "Three massive sacred stones standing against towering bamboo forests with shimenawa rope forming a makeshift torii gate. Locals perform rain rituals at this dramatic site representing the most ancient form of Shinto nature worship.",
    "shortDescription": "Ancient Shinto site of three sacred stones in bamboo forest — raw nature worship without buildings.",
    "lat": 35.2,
    "lng": 132.8
  },
  {
    "name": "Chizu Post Town",
    "nameJapanese": "智頭宿",
    "city": "Chizu",
    "prefecture": "Tottori",
    "region": "Chugoku",
    "category": "landmark",
    "description": "A well-preserved post town with the magnificent Ishitani Family Residence, an Important Cultural Property showcasing the architecture and wealth of rural Tottori's elite. Preserves authenticity lost to commercialization elsewhere.",
    "shortDescription": "Preserved post town with a magnificent village headman's residence, free of commercialization.",
    "lat": 35.26,
    "lng": 134.23
  },
  {
    "name": "Iya Valley",
    "nameJapanese": "祖谷渓",
    "city": "Miyoshi",
    "prefecture": "Tokushima",
    "region": "Shikoku",
    "category": "nature",
    "description": "Called the 'Tibet of Japan,' this remote mountain valley features the Kazurabashi vine bridge stretching 45 meters across the Iya River. Originally used by fleeing Heike warriors in the 12th century, it is rebuilt every three years with kiwi vines.",
    "shortDescription": "Remote 'Tibet of Japan' valley with a 45-meter vine bridge originally built by fleeing samurai.",
    "lat": 33.88,
    "lng": 133.82
  },
  {
    "name": "Nagoro Scarecrow Village",
    "nameJapanese": "名頃かかしの里",
    "city": "Miyoshi",
    "prefecture": "Tokushima",
    "region": "Shikoku",
    "category": "landmark",
    "description": "A village where over 350 life-sized scarecrows outnumber the approximately 30 human residents by more than 10 to 1. Created by artist Tsukimi Ayano in the likenesses of former residents, occupying homes, schools, and bus stops.",
    "shortDescription": "Surreal village where 350 life-sized scarecrows outnumber 30 human residents by 10 to 1.",
    "lat": 33.9,
    "lng": 133.88
  },
  {
    "name": "Niyodo River",
    "nameJapanese": "仁淀川",
    "city": "Niyodogawa",
    "prefecture": "Kochi",
    "region": "Shikoku",
    "category": "nature",
    "description": "Consistently ranked as Japan's most beautiful river, famous for its almost surreal cobalt-blue color nicknamed 'Niyodo Blue.' The Yasui Gorge features moss-covered cliffs and water so clear the riverbed stones are perfectly visible.",
    "shortDescription": "Japan's purest river with surreal 'Niyodo Blue' cobalt waters and crystal-clear gorges.",
    "lat": 33.56,
    "lng": 133.14
  },
  {
    "name": "Shimanto River",
    "nameJapanese": "四万十川",
    "city": "Shimanto",
    "prefecture": "Kochi",
    "region": "Shikoku",
    "category": "nature",
    "description": "Japan's last free-flowing major river with no dams on its mainstream. Features 47 chinkabashi (submersible bridges) built without parapets so they submerge during floods rather than being destroyed.",
    "shortDescription": "Japan's last undammed major river with 47 unique submersible bridges that survive floods intact.",
    "lat": 32.98,
    "lng": 132.93
  },
  {
    "name": "Yusuhara",
    "nameJapanese": "梼原町",
    "city": "Yusuhara",
    "prefecture": "Kochi",
    "region": "Shikoku",
    "category": "landmark",
    "description": "A remote mountain town at 1,400 meters containing six buildings by Kengo Kuma, architect of the Tokyo Olympic stadium. Over 90% forested, with a 'Library Above the Clouds' featuring an inverted-forest cedar ceiling.",
    "shortDescription": "Remote mountain town with six Kengo Kuma buildings including a 'Library Above the Clouds.'",
    "lat": 33.39,
    "lng": 132.93
  },
  {
    "name": "Dogo Onsen",
    "nameJapanese": "道後温泉",
    "city": "Matsuyama",
    "prefecture": "Ehime",
    "region": "Shikoku",
    "category": "onsen",
    "description": "Japan's oldest hot spring with a 3,000-year history. The wooden Honkan bathhouse from 1894 is a National Important Cultural Property said to have inspired Spirited Away's bathhouse. The interior is a labyrinth of stairways and tatami rooms.",
    "shortDescription": "Japan's oldest 3,000-year-old hot spring with a labyrinthine 1894 bathhouse inspiring Spirited Away.",
    "lat": 33.85,
    "lng": 132.79
  },
  {
    "name": "Uchiko",
    "nameJapanese": "内子町",
    "city": "Uchiko",
    "prefecture": "Ehime",
    "region": "Shikoku",
    "category": "landmark",
    "description": "A wax and paper production town preserving 600 meters of traditional houses spanning the Edo, Meiji, and Taisho periods. The Uchiko-za theater from 1916 still hosts kabuki, bunraku, and taiko performances.",
    "shortDescription": "Preserved merchant quarter spanning three centuries with an active 1916 kabuki theater.",
    "lat": 33.54,
    "lng": 132.65
  },
  {
    "name": "Kotohira",
    "nameJapanese": "琴平",
    "city": "Kotohira",
    "prefecture": "Kagawa",
    "region": "Shikoku",
    "category": "entertainment",
    "description": "Home to Konpira-san shrine (1,368 steps) and the Kanamaru-za, Japan's oldest surviving kabuki theater from 1835. The theater features a manually operated rotating stage and trap doors restored to Edo-period appearance.",
    "shortDescription": "Pilgrimage town with a 1,368-step shrine and Japan's oldest surviving 1835 kabuki theater.",
    "lat": 34.19,
    "lng": 133.82
  },
  {
    "name": "Shodoshima Island",
    "nameJapanese": "小豆島",
    "city": "Shodoshima",
    "prefecture": "Kagawa",
    "region": "Shikoku",
    "category": "nature",
    "description": "The second-largest Seto Inland Sea island with Japan's first olive cultivation since 1908. Features Angel Road — a 500-meter sandbar connecting islands that appears only twice daily at low tide. Also known for 400-year-old soy sauce production.",
    "shortDescription": "Mediterranean-climate island with Japan's first olives and a twice-daily disappearing sandbar.",
    "lat": 34.49,
    "lng": 134.23
  },
  {
    "name": "Kankakei Gorge",
    "nameJapanese": "寒霞渓",
    "city": "Shodoshima",
    "prefecture": "Kagawa",
    "region": "Shikoku",
    "category": "nature",
    "description": "One of Japan's three most beautiful gorges, formed over 2 million years. The only ropeway in Japan offering simultaneous views of sky, sea, and gorge during a 5-minute ride from 295 to 612 meters.",
    "shortDescription": "One of Japan's three most beautiful gorges with the only sky-sea-gorge ropeway in Japan.",
    "lat": 34.5,
    "lng": 134.27
  },
  {
    "name": "Tairyuji Temple",
    "nameJapanese": "太龍寺",
    "city": "Anan",
    "prefecture": "Tokushima",
    "region": "Shikoku",
    "category": "temple",
    "description": "A mountain-top pilgrimage temple atop Mount Shashinzan surrounded by ancient cedars, one of the most challenging temples on the 88-temple Shikoku Pilgrimage. A ropeway offers sweeping views of mountains and farms.",
    "shortDescription": "Dramatic mountain-top pilgrimage temple on the Shikoku 88, reached by ropeway over valleys.",
    "lat": 33.85,
    "lng": 134.49
  },
  {
    "name": "Yokomineji Temple",
    "nameJapanese": "横峰寺",
    "city": "Saijo",
    "prefecture": "Ehime",
    "region": "Shikoku",
    "category": "temple",
    "description": "Situated on Mount Ishizuchi (western Japan's highest peak at 1,982m), one of the most difficult temples on the 88-temple pilgrimage. The arduous mountain forest approach rewards with extraordinary elevation and solitude.",
    "shortDescription": "One of Shikoku's most difficult pilgrimage temples on western Japan's highest mountain.",
    "lat": 33.83,
    "lng": 133.1
  },
  {
    "name": "Oboke and Koboke Gorges",
    "nameJapanese": "大歩危・小歩危",
    "city": "Miyoshi",
    "prefecture": "Tokushima",
    "region": "Shikoku",
    "category": "nature",
    "description": "Twin gorges carved by the Yoshino River through crystalline schist rock over 200 million years. 'Big dangerous steps' and 'little dangerous steps' feature dramatic formations, emerald water, and class IV whitewater rafting.",
    "shortDescription": "200-million-year-old twin gorges with emerald water and class IV whitewater rafting.",
    "lat": 33.94,
    "lng": 133.82
  },
  {
    "name": "Katsurahama Beach",
    "nameJapanese": "桂浜",
    "city": "Kochi",
    "prefecture": "Kochi",
    "region": "Shikoku",
    "category": "beach",
    "description": "A dramatic crescent beach famous for the imposing statue of Sakamoto Ryoma gazing out to sea. Pine-covered headlands frame both ends. Swimming is prohibited due to strong currents, adding to its contemplative character.",
    "shortDescription": "Crescent beach with a statue of revolutionary samurai Ryoma gazing across the untamed Pacific.",
    "lat": 33.49,
    "lng": 133.57
  },
  {
    "name": "Ritsurin Garden",
    "nameJapanese": "栗林公園",
    "city": "Takamatsu",
    "prefecture": "Kagawa",
    "region": "Shikoku",
    "category": "garden",
    "description": "One of Japan's finest landscape gardens, developed over 100 years by feudal lords. Spread across 75 hectares with six ponds and thirteen hills set against Mount Shiun. Often ranked alongside Japan's top three gardens.",
    "shortDescription": "75-hectare feudal garden with six ponds and thirteen hills rivaling Japan's top three gardens.",
    "lat": 34.33,
    "lng": 134.05
  },
  {
    "name": "Monet's Garden Marmottan",
    "nameJapanese": "北川村モネの庭マルモッタン",
    "city": "Kitagawa",
    "prefecture": "Kochi",
    "region": "Shikoku",
    "category": "garden",
    "description": "The only garden officially permitted by the Fondation Claude Monet to use Monet's name. Recreates three gardens, growing blue water lilies that Monet himself could never cultivate in Giverny thanks to Kochi's subtropical climate.",
    "shortDescription": "World's only officially licensed Monet garden, growing blue water lilies impossible at Giverny.",
    "lat": 33.44,
    "lng": 134.18
  },
  {
    "name": "Matsuyama Castle",
    "nameJapanese": "松山城",
    "city": "Matsuyama",
    "prefecture": "Ehime",
    "region": "Shikoku",
    "category": "landmark",
    "description": "One of only 12 original surviving castles in Japan, perched on a hilltop with 360-degree views of Matsuyama and the Seto Inland Sea. Accessible by ropeway or chairlift, with the keep dating from 1854.",
    "shortDescription": "One of Japan's 12 original castles with hilltop 360-degree views, reached by ropeway.",
    "lat": 33.85,
    "lng": 132.77
  },
  {
    "name": "Senyuji Temple",
    "nameJapanese": "仙遊寺",
    "city": "Imabari",
    "prefecture": "Ehime",
    "region": "Shikoku",
    "category": "temple",
    "description": "A pilgrimage temple often hidden in mountain fog, offering the rare opportunity to try shojin ryori (Buddhist vegetarian cuisine) that the monks eat. The mist-shrouded mountaintop setting is genuinely mystical.",
    "shortDescription": "Fog-shrouded pilgrimage temple offering authentic Buddhist vegetarian cuisine with the monks.",
    "lat": 34.01,
    "lng": 133.02
  },
  {
    "name": "Kunisaki Peninsula Temples",
    "nameJapanese": "国東半島 六郷満山",
    "city": "Kunisaki",
    "prefecture": "Oita",
    "region": "Kyushu",
    "category": "temple",
    "description": "A remote peninsula dotted with 1,300-year-old temples blending Buddhism, Shinto, and mountain worship. The 137km Minemichi Long Trail follows ancient monk pilgrimage routes past cliff-carved Buddhas and Kyushu's oldest wooden structure.",
    "shortDescription": "1,300-year-old peninsula temples blending three religions along a 137km ancient pilgrimage trail.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Kabeyu Hot Spring",
    "nameJapanese": "壁湯温泉",
    "city": "Kokonoe",
    "prefecture": "Oita",
    "region": "Kyushu",
    "category": "onsen",
    "description": "A secret cave onsen where bathers soak in a natural rock cavern with smooth alkaline waters. The bath sits inside a literal cave formation along a river with no English signage — requires local knowledge to find.",
    "shortDescription": "Secret cave onsen in a natural rock cavern along a river, requiring local knowledge to find.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Myoban Onsen",
    "nameJapanese": "明礬温泉",
    "city": "Beppu",
    "prefecture": "Oita",
    "region": "Kyushu",
    "category": "onsen",
    "description": "Beppu's highest-elevation onsen district featuring Yunohana Huts — traditional thatched-roof structures where natural bath salts have been produced for centuries using volcanic steam. The milky-blue sulfurous waters are raw and pre-industrial.",
    "shortDescription": "Beppu's highest onsen with centuries-old volcanic bath salt huts and milky-blue sulfur waters.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Kurokawa Onsen",
    "nameJapanese": "黒川温泉",
    "city": "Minamioguni",
    "prefecture": "Kumamoto",
    "region": "Kyushu",
    "category": "onsen",
    "description": "A mountain hot spring village at 700m with 30 ryokan each having unique spring sources. Deliberately preserved with wooden buildings and earthen walls — no neon or concrete. Features 7 of Japan's 10 classified hot spring types.",
    "shortDescription": "Traditional mountain village with 30 unique hot spring ryokan and 7 of Japan's 10 spring types.",
    "lat": 33.13,
    "lng": 131.1
  },
  {
    "name": "Reigando Cave",
    "nameJapanese": "霊巌洞",
    "city": "Kumamoto",
    "prefecture": "Kumamoto",
    "region": "Kyushu",
    "category": "landmark",
    "description": "A sacred cave where legendary swordsman Miyamoto Musashi spent his final years writing 'The Book of Five Rings.' The cave has a deeply contemplative atmosphere with surrounding rock-carved Buddhist figures on Mount Kinpo.",
    "shortDescription": "Sacred cave where Miyamoto Musashi wrote The Book of Five Rings in his final years.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Sakitsu Village",
    "nameJapanese": "崎津集落",
    "city": "Amakusa",
    "prefecture": "Kumamoto",
    "region": "Kyushu",
    "category": "landmark",
    "description": "A UNESCO World Heritage fishing village where Hidden Christians secretly practiced faith for 250 years. The Gothic-style Sakitsu Church (rebuilt 1934) is unique in Japan for having tatami mat flooring.",
    "shortDescription": "UNESCO Hidden Christian fishing village with Japan's only tatami-floored Gothic church.",
    "lat": 32.31,
    "lng": 130.03
  },
  {
    "name": "Takachiho Gorge",
    "nameJapanese": "高千穂峡",
    "city": "Takachiho",
    "prefecture": "Miyazaki",
    "region": "Kyushu",
    "category": "nature",
    "description": "A breathtaking ravine through volcanic basalt cliffs with the 17-meter Manai-no-Taki waterfall cascading into emerald waters. Visitors paddle rowboats beneath the falls. The basalt columns rise up to 100 meters from ancient Aso eruptions.",
    "shortDescription": "Volcanic basalt gorge with a 17-meter waterfall and rowboat rides through 100-meter cliffs.",
    "lat": 32.75,
    "lng": 131.37
  },
  {
    "name": "Amano Iwato Shrine",
    "nameJapanese": "天岩戸神社",
    "city": "Takachiho",
    "prefecture": "Miyazaki",
    "region": "Kyushu",
    "category": "shrine",
    "description": "The shrine marks the cave where sun goddess Amaterasu hid, plunging the world into darkness. A forest path leads to Amano Yasukawara, a vast cave filled with thousands of stacked prayer stones where eight million deities gathered.",
    "shortDescription": "Mythological cave shrine where the sun goddess hid, with a prayer-stone-filled gathering cave.",
    "lat": 32.76,
    "lng": 131.33
  },
  {
    "name": "Udo Jingu Shrine",
    "nameJapanese": "鵜戸神宮",
    "city": "Nichinan",
    "prefecture": "Miyazaki",
    "region": "Kyushu",
    "category": "shrine",
    "description": "A rare 'descending shrine' with its main hall built inside a natural sea cave carved into Pacific-facing cliffs. The Undama stone-throwing ritual lets visitors toss clay pebbles at a hollow in the rocks below.",
    "shortDescription": "Shrine built inside a sea cave in Pacific cliffs, with a clay-pebble throwing wish ritual.",
    "lat": 31.63,
    "lng": 131.44
  },
  {
    "name": "Aoshima Shrine",
    "nameJapanese": "青島神社",
    "city": "Miyazaki",
    "prefecture": "Miyazaki",
    "region": "Kyushu",
    "category": "shrine",
    "description": "A shrine hidden inside a dense subtropical palm forest on tiny Aoshima Island, surrounded by the 'Devil's Washboard' — geometric basalt rock formations extending into the sea. Over 5,000 wild palm trees conceal the shrine from the beach.",
    "shortDescription": "Subtropical palm-forest shrine on a tiny island surrounded by geometric basalt formations.",
    "lat": 31.8,
    "lng": 131.47
  },
  {
    "name": "Yutoku Inari Shrine",
    "nameJapanese": "祐徳稲荷神社",
    "city": "Kashima",
    "prefecture": "Saga",
    "region": "Kyushu",
    "category": "shrine",
    "description": "One of Japan's three most important Inari shrines, this 17th-century vermillion complex snakes up a forested hillside. Delivers the same visual impact as Fushimi Inari but without the crowds.",
    "shortDescription": "Top-three Inari shrine rivaling Fushimi Inari in beauty — without the crowds.",
    "lat": 33.05,
    "lng": 130.1
  },
  {
    "name": "Arita",
    "nameJapanese": "有田",
    "city": "Arita",
    "prefecture": "Saga",
    "region": "Kyushu",
    "category": "landmark",
    "description": "The birthplace of Japanese porcelain with historic kilns dating to the 1600s. The tradition began when Korean potters discovered kaolin clay here during Toyotomi Hideyoshi's invasions. Features a distinctive blue torii gate.",
    "shortDescription": "400-year birthplace of Japanese porcelain with historic kilns and a distinctive blue torii gate.",
    "lat": 33.18,
    "lng": 129.89
  },
  {
    "name": "Goto Islands",
    "nameJapanese": "五島列島",
    "city": "Goto",
    "prefecture": "Nagasaki",
    "region": "Kyushu",
    "category": "landmark",
    "description": "An archipelago of 152 islands with 50 historic churches (4 UNESCO World Heritage) built by Hidden Christians after 250 years of persecution. Combines religious heritage with pristine beaches and coral reefs.",
    "shortDescription": "152-island archipelago with 50 Hidden Christian churches, 4 of which are UNESCO World Heritage.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Nagakushiyama Park",
    "nameJapanese": "長串山公園",
    "city": "Sasebo",
    "prefecture": "Nagasaki",
    "region": "Kyushu",
    "category": "park",
    "description": "A mountainside park overlooking the Kujukushima Islands where over 100,000 azaleas bloom in spring, creating a carpet of color above the scattered island seascape. One of Nagasaki Prefecture's most spectacular panoramic views.",
    "shortDescription": "Mountain park where 100,000 azaleas bloom above a scattered seascape of 99 islands.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Miyajidake Shrine",
    "nameJapanese": "宮地嶽神社",
    "city": "Fukutsu",
    "prefecture": "Fukuoka",
    "region": "Kyushu",
    "category": "shrine",
    "description": "A 1,600-year-old shrine with Japan's largest shimenawa (sacred rope) weighing approximately 3 tons. Twice yearly, the setting sun aligns with the approach road creating a 'Path of Light' extending from shrine steps to the sea.",
    "shortDescription": "1,600-year-old shrine with Japan's largest sacred rope and a twice-yearly solar 'Path of Light.'",
    "lat": 33.78,
    "lng": 130.47
  },
  {
    "name": "Shiraito Falls Fukuoka",
    "nameJapanese": "白糸の滝",
    "city": "Itoshima",
    "prefecture": "Fukuoka",
    "region": "Kyushu",
    "category": "nature",
    "description": "A scenic 24-meter waterfall on Mount Hagane surrounded by lush forest. Families enjoy trout fishing and nagashi somen — flowing noodles caught with chopsticks from a bamboo flume — at the base of the falls.",
    "shortDescription": "24-meter forest waterfall with traditional flowing-noodle dining at the base.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Chikurin-no-Yu",
    "nameJapanese": "竹林の湯",
    "city": "Kirishima",
    "prefecture": "Kagoshima",
    "region": "Kyushu",
    "category": "onsen",
    "description": "A wild hot spring 10 minutes from Kagoshima Airport, sitting in a bamboo grove with naturally heated volcanic water. Completely raw and unmanicured — no facilities, no changing rooms, just hot water and forest.",
    "shortDescription": "Wild bamboo-grove hot spring minutes from Kagoshima Airport — no facilities, pure volcanic water.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Yakushima Hidden Trails",
    "nameJapanese": "屋久島",
    "city": "Yakushima",
    "prefecture": "Kagoshima",
    "region": "Kyushu",
    "category": "nature",
    "description": "Beyond the famous Jomon Sugi trail, Yakushima holds lesser-walked paths through Shiratani Unsuikyo's secret waterfalls and the high-altitude Hananoego peat bog resembling a Japanese garden. The Seibu Rindo forest offers encounters with wild deer and monkeys.",
    "shortDescription": "Yakushima's secret trails beyond Jomon Sugi — hidden waterfalls, highland bogs, and wild monkeys.",
    "lat": 30.35,
    "lng": 130.5
  },
  {
    "name": "Iki Island",
    "nameJapanese": "壱岐島",
    "city": "Iki",
    "prefecture": "Nagasaki",
    "region": "Kyushu",
    "category": "nature",
    "description": "A small island between Kyushu and Tsushima known for rugged coastal scenery, gorgeous beaches, and Japan's finest sea urchin. Ancient burial mounds and Shinto shrines connect to Japan's oldest historical records.",
    "shortDescription": "Island between Kyushu and Tsushima with Japan's finest sea urchin and ancient burial mounds.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Onbara Falls",
    "nameJapanese": "遠原の滝",
    "city": "Beppu",
    "prefecture": "Oita",
    "region": "Kyushu",
    "category": "nature",
    "description": "A stunning cascading waterfall just outside Beppu, reached via a short one-mile trek that immerses you in dense subtropical jungle. The contrast between tourist-heavy Beppu and this secluded spot is striking.",
    "shortDescription": "Secluded subtropical jungle waterfall just outside Beppu, hidden from the tourist crowds.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Oe Catholic Church",
    "nameJapanese": "大江天主堂",
    "city": "Amakusa",
    "prefecture": "Kumamoto",
    "region": "Kyushu",
    "category": "landmark",
    "description": "A Romanesque church built in 1933 atop a hill by a French missionary and local Hidden Christian followers. Represents the moment when 250 years of secret faith could finally be expressed openly, with ocean views.",
    "shortDescription": "1933 hilltop church where 250 years of Hidden Christian faith was finally expressed openly.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Me-no-Yu",
    "nameJapanese": "目の湯",
    "city": "Kirishima",
    "prefecture": "Kagoshima",
    "region": "Kyushu",
    "category": "onsen",
    "description": "Kirishima's oldest rock bath, where hot spring water naturally pools in a volcanic rock depression for just 1-2 people. Located a 1-minute walk from the Maruo Nature Trail entrance — onsen in its most elemental form.",
    "shortDescription": "Kirishima's oldest single-person natural rock bath — hot spring water in a volcanic depression.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Kotohira Onsen Hita",
    "nameJapanese": "琴平温泉",
    "city": "Hita",
    "prefecture": "Oita",
    "region": "Kyushu",
    "category": "onsen",
    "description": "A secluded onsen found by following the Takase River, just 10 minutes from Hita Station but feeling like unexplored wilderness. Tucked in dense forest along the riverbank with only a small signboard marking its presence.",
    "shortDescription": "Forest-hidden riverside onsen 10 minutes from Hita Station, marked by a single small sign.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Valley of Gangala",
    "nameJapanese": "ガンガラーの谷",
    "city": "Nanjo",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "nature",
    "description": "Formed when a massive limestone cave collapsed, this valley reveals a 1km trail through ancient subtropical forest. The entrance begins inside an intact cave section serving as a cafe. Archaeological excavations found evidence of 18,000-year-old human habitation.",
    "shortDescription": "Collapsed cave turned subtropical valley with a cave-entrance cafe and 18,000-year-old human traces.",
    "lat": 26.31,
    "lng": 127.75
  },
  {
    "name": "Sefa Utaki",
    "nameJapanese": "斎場御嶽",
    "city": "Nanjo",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "shrine",
    "description": "The most sacred site of the Ryukyu Kingdom, a UNESCO World Heritage grove where the highest priestess was inaugurated. The iconic triangular Sangui tunnel frames a view of sacred Kudaka Island where the creator deity first descended.",
    "shortDescription": "Most sacred Ryukyuan site with a triangular rock tunnel framing the creator deity's island.",
    "lat": 26.17,
    "lng": 127.83
  },
  {
    "name": "Daisekirinzan",
    "nameJapanese": "大石林山",
    "city": "Kunigami",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "nature",
    "description": "Okinawa's oldest geological formation with bizarre 200-million-year-old karst limestone pinnacles, a 60,000-strong cycad colony, and Japan's largest Chinese banyan tree. Four trails thread through formations designated sacred by Ryukyu creation myths.",
    "shortDescription": "200-million-year-old sacred karst pinnacles with Japan's largest banyan tree in far northern Okinawa.",
    "lat": 26.87,
    "lng": 128.25
  },
  {
    "name": "Cape Hedo",
    "nameJapanese": "辺戸岬",
    "city": "Kunigami",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "viewpoint",
    "description": "Okinawa's northernmost point where jagged karst cliffs meet the convergence of the East China Sea and Pacific Ocean. On clear days, Yoron Island is visible. The raw, wind-swept landscape feels completely different from resort southern Okinawa.",
    "shortDescription": "Okinawa's wind-swept northernmost cliff where the East China Sea meets the Pacific Ocean.",
    "lat": 26.87,
    "lng": 128.25
  },
  {
    "name": "Gesashi Bay Mangroves",
    "nameJapanese": "慶佐次湾のヒルギ林",
    "city": "Higashi",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "nature",
    "description": "A 10-hectare mangrove forest, the largest on Okinawa's main island. Visitors explore via boardwalks or guided kayak excursions through tidal channels. The ecosystem supports unique wildlife including mudskippers and fiddler crabs.",
    "shortDescription": "Okinawa's largest mangrove forest explored by kayak through tidal channels with unique wildlife.",
    "lat": 26.62,
    "lng": 128.15
  },
  {
    "name": "Kudaka Island",
    "nameJapanese": "久高島",
    "city": "Nanjo",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "shrine",
    "description": "Revered as where the creator deity Amamikiyo first descended from heaven. This small island has no resort developments — only quiet sacred groves, a traditional fishing village, and deep spiritual significance. Collecting rocks or plants is forbidden.",
    "shortDescription": "Sacred island where the Ryukyuan creator deity descended — no development, collecting forbidden.",
    "lat": 26.16,
    "lng": 127.89
  },
  {
    "name": "Iheya Island",
    "nameJapanese": "伊平屋島",
    "city": "Iheya",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "nature",
    "description": "A peaceful island with connections to Ryukyu royalty — King Sho En was born here. Crystal-clear waters, quiet beaches, and traditional village atmosphere define the experience with minimal tourism even by outer-island standards.",
    "shortDescription": "Peaceful royal-heritage island with crystal waters and almost zero tourism infrastructure.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Kumejima Island",
    "nameJapanese": "久米島",
    "city": "Kumejima",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "nature",
    "description": "A small island reachable by 30-minute flight from Naha with Ryukyu castle ruins, natural rock pools, and the famous Hatenohama — a 7km uninhabited sandbar appearing at low tide. Far fewer tourists than other Okinawan islands.",
    "shortDescription": "Accessible island with castle ruins and a 7km phantom sandbar appearing only at low tide.",
    "lat": 26.34,
    "lng": 126.78
  },
  {
    "name": "Musunun Beach",
    "nameJapanese": "ムスヌン浜",
    "city": "Miyakojima",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "beach",
    "description": "A hidden beach on Kurima Island connected to Miyakojima by bridge, with white sand and clear emerald-green sea. Unlike Miyakojima's packed beaches, Musunun sees almost no visitors. The approach is unmarked and requires local knowledge.",
    "shortDescription": "Secret unmarked beach on Kurima Island with pristine white sand and almost zero visitors.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Yanbaru Forest",
    "nameJapanese": "やんばるの森",
    "city": "Kunigami",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "nature",
    "description": "A 174 sq km UNESCO Natural World Heritage subtropical wilderness in northern Okinawa. Home to endemic species found nowhere else on Earth including the Okinawa rail. Night tours with local guides reveal nocturnal wildlife.",
    "shortDescription": "UNESCO subtropical wilderness with species found nowhere else on Earth, explored by night tours.",
    "lat": null,
    "lng": null
  },
  {
    "name": "Zamami Island",
    "nameJapanese": "座間味島",
    "city": "Zamami",
    "prefecture": "Okinawa",
    "region": "Okinawa",
    "category": "nature",
    "description": "A Kerama Islands gem offering world-class snorkeling in 'Kerama Blue' waters, whale watching from January to March, and uninhabited satellite islets reachable by kayak. Sea turtle encounters are common while snorkeling.",
    "shortDescription": "Kerama Islands paradise with 'Kerama Blue' snorkeling, whale watching, and sea turtle encounters.",
    "lat": 26.23,
    "lng": 127.3
  },
  {
    "name": "Yoron Island",
    "nameJapanese": "与論島",
    "city": "Yoron",
    "prefecture": "Kagoshima",
    "region": "Okinawa",
    "category": "nature",
    "description": "A remote island surrounded by coral reefs featuring Yurigahama Beach — a phantom sandbar appearing only during low tides, creating a temporary beach in the middle of the ocean. Culturally closer to Okinawa than mainland Kagoshima.",
    "shortDescription": "Remote coral island with a phantom sandbar beach that appears only at low tide in the open ocean.",
    "lat": 27.04,
    "lng": 128.41
  }
]